Revit 2025 API
Zone.CalculatedHeatingLoad Property
Get the Calculated Heating Load of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double CalculatedHeatingLoad { get; }
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
public:
property double CalculatedHeatingLoad {
	double get ();
}
member CalculatedHeatingLoad : float with get
Property Value
Double
Remarks
This property is used to get the Calculated Heating Load of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace